# Step 3

In [1]:
# Import libraries

import pandas as pd
import numpy as np
import os

In [2]:
# Import data

path = r'C:\Users\jeong\OneDrive\Desktop\CF Files\Achievement 4\07-2023 Instacart Basket Analysis'

df_customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

In [3]:
ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged_updated3.pkl'))

In [4]:
# Check shape

df_customers.shape

(206209, 10)

In [5]:
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# Step 4

In [6]:
# Rename columns
    
df_customers.rename(columns={'First Name' : 'first_name', 'Surnam':'last_name', 'Gender':'sex', 'STATE':'state',
                                           
'Age':'age', 'fam_status':'martial_status'}, inplace = True)

In [7]:
# Check if columns were renamed succesfully

df_customers.head()

,user_id,first_name,last_name,sex,state,age,date_joined,n_dependants,martial_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [8]:
# Summary stats of df_customers

df_customers.describe()

             user_id            age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [9]:
# Check data types of columms in df_customers

df_customers.dtypes

user_id            int64
first_name        object
last_name         object
sex               object
state             object
age                int64
date_joined       object
n_dependants       int64
martial_status    object
income             int64
dtype: object

In [10]:
# Change user_id dtype to string in df_customers

df_customers['user_id'] = df_customers['user_id'].astype(str)

In [11]:
# Check if dtype is correct

df_customers['user_id'].dtype

dtype('O')

# Step 5

In [12]:
# Check for mixed data types

for col in df_customers.columns.tolist():
    weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis=1)
    if len(df_customers[weird]) > 0:
        print(col)

first_name

In [13]:
# Fixed mixed data type by converting values in 'first_name' to str

df_customers['first_name'] = df_customers['first_name'].astype(str)

In [14]:
# Check for missing/null values

df_customers.isnull().sum()

# No missing values

user_id           0
first_name        0
last_name         0
sex               0
state             0
age               0
date_joined       0
n_dependants      0
martial_status    0
income            0
dtype: int64

In [15]:
# Check for duplicates

df_dups = df_customers[df_customers.duplicated()]
df_dups

# No duplicates

Empty DataFrame
Columns: [user_id, first_name, last_name, sex, state, age, date_joined, n_dependants, martial_status, income]
Index: []

# Step 6

In [16]:
# Check shape of ords_prods_merge

ords_prods_merge.shape

(32404859, 24)

In [17]:
ords_prods_merge.head()

,order_id,user_id,order_number,orders_day_of_the_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered,product_name,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,average_price,spending_flag,median_last_order,last_order_frequency
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Mid range product,Regulary busy,Regulary busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,Mid range product,Regulary busy,Least busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,Mid range product,Regulary busy,Least busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,Mid range product,Least busy,Least busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,Mid range product,Least busy,Least busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer

In [18]:
ords_prods_merge.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 24 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int64
 1   user_id                 int64
 2   order_number            int64
 3   orders_day_of_the_week  int64
 4   order_hour_of_day       int64
 5   days_since_last_order   float64
 6   product_id              int64
 7   add_to_cart_order       int64
 8   reordered               int64
 9   product_name            object
 10  aisle_id                int64
 11  department_id           int64
 12  prices                  float64
 13  _merge                  category
 14  price_range_loc         object
 15  busiest_day             object
 16  busiest_days            object
 17  busiest_period_of_day   object
 18  max_order               int64
 19  loyalty_flag            object
 20  average_price           float64
 21  spending_flag           object
 22  median_last_order       float64
 23  last_order_frequency    object
dtypes: category(1), float64(4), int64(11), object(8)
memory usage: 5.8+ GB

In [19]:
# Change 'user_id' dtype in ords_prods_merge to match df_customer 'user_id'

ords_prods_merge['user_id']  = ords_prods_merge['user_id'].astype(str)

In [20]:
# Check if 'user_id' dtype changed successfully

ords_prods_merge['user_id'].dtype

dtype('O')

In [21]:
# Drop _merge column to combine with df_customers

ords_prods_merge = ords_prods_merge.drop(columns = ['_merge'])

In [22]:
# Check if drop was succesful

ords_prods_merge.shape

(32404859, 23)

In [23]:
# Look at df_customers shape before merge

df_customers.shape

(206209, 10)

In [24]:
# Merge dataframes on user_id

ords_prods_cust_merge = df_customers.merge(ords_prods_merge, on = 'user_id', indicator = True)

In [25]:
ords_prods_cust_merge.head()

,user_id,first_name,last_name,sex,state,age,date_joined,n_dependants,martial_status,income,...,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,average_price,spending_flag,median_last_order,last_order_frequency,_merge
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Regulary busy,Busiest days,Average orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both
1,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Regulary busy,Regulary busy,Average orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both
2,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Regulary busy,Busiest days,Average orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both
3,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Regulary busy,Regulary busy,Average orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both
4,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Regulary busy,Least busy,Average orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both

In [26]:
# Check shape of df_merge
ords_prods_cust_merge.shape

(32404859, 33)

# Step 8

In [27]:
# Export dataframe

ords_prods_cust_merge.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_cust_merged.pkl'))